{"version":1,"resource":"file:///home/bryan/.config/quickshell/scripts/list-apps.sh","entries":[{"id":"jfyh.sh","source":"Chat Edit: 'The apps listed in the app launcher appear to be the hard-coded ones that were there for the mockup, but should be replaced by the system apps and respective icons. Can this be updated?\n\nThe power menu will need to be a bit taller to accommodate the items along the bottom of the widget--Navigation, Confirm, and Cancel are all getting cut off. Remember to keep the padding around the outside the same all the way around.\n\nI would also like to exchange these emoji icons with Material 3 icons from Google, if possible.'","timestamp":1760641248533},{"id":"Xdlj.sh","source":"Chat Edit: 'Sorry if my last instruction was confusing--for the app launcher, those icons should be the same icons that the system uses to display the application. The material icons were only necessary for the power menu, which looks great now, by the way!'","timestamp":1760641468752},{"id":"UC33.sh","source":"Chat Edit: 'How does one go about omitting certain apps from the app launcher list? For instance, the first item, About Xfce isn't necessary, so it would be nice to hide it from the menu.'","timestamp":1760641995754},{"id":"Yxxl.sh","source":"Chat Edit: 'I can still see the About Xfce app in the list. I think the global .desktop setting is probably overriding everything else.'","timestamp":1760642167864},{"id":"MvG7.sh","source":"Chat Edit: 'Can we add lstopo.desktop to the list of hidden apps?'","timestamp":1760642636577},{"id":"qoGf.sh","source":"Chat Edit: 'I don't really care to have access to uuctl from the app launcher, if you'd like to add that one to the list. The rest should be good.'","timestamp":1760645118038},{"id":"H03q.sh","source":"Chat Edit: 'Can you help me hide the following applications so they don't appear in the app launcher?\n\n1. VSCodium - there are 2 in the launcher, one regular application that I would like removed, and the VSCodium - Wayland option which is what I use on Hyprland. I don't need to see both.\n\n2. Xgps - I will never use this, and in the rare case that I would, I can call the application through the terminal.\n\n3. Xgpsspeed - same as the second app. I'm not going to use this.'","timestamp":1760967826958},{"id":"0os0.sh","source":"Chat Edit: 'There are a couple of issues now. There are two Flameshot apps listed in the launcher and a notification warning about the grimshot adapter vs dbus protocol. See the screenshot for details. '","timestamp":1761509310615},{"id":"xKb6.sh","source":"Chat Edit: 'There are a couple of issues now. There are two Flameshot apps listed in the launcher and a notification warning about the grimshot adapter vs dbus protocol. See the screenshot for details. '","timestamp":1761509325117},{"id":"1Z0K.sh","source":"Chat Edit: 'It seems that a few issues are cleared up, but nothing launches now.'","timestamp":1761509607922},{"id":"BDO9.sh","source":"Chat Edit: 'The app launcher is not updating when flatpak apps are installed. Can you add support for flatpak apps?'","timestamp":1761515890507},{"id":"Cha0.sh","source":"Chat Edit: 'I'm not seeing either application yet.'","timestamp":1761516134801},{"id":"vNKN.sh","source":"Chat Edit: 'I'm not seeing either application yet.'","timestamp":1761516162044},{"id":"tQ5d.sh","source":"Chat Edit: 'I'm not seeing either application yet.'","timestamp":1761516191669},{"id":"h62g.sh","timestamp":1761580183228}]}